import 'package:islami_app/models/hadith_data_model.dart';

abstract class HadithDataConstraints {
  static List<String> hadithTitle = [
    "الحديث الاول",
    "الحديث الثاني",
    "الحديث الثالث",
    "الحديث الرابع",
    "الحديث الخامس",
  ];
  static List<String> hadithContent = [
    "1. عن أمير المؤمنين أبي حفص عمر بن الخطاب رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى...\" \nرواه البخاري ومسلم.",
    "2. عن عمر بن الخطاب رضي الله عنه أيضًا قال: بينما نحن جلوس عند رسول الله صلى الله عليه وسلم ذات يوم، إذ طلع علينا رجل شديد بياض الثياب... قال: أخبرني عن الإسلام... قال: الإسلام أن تشهد أن لا إله إلا الله... \nرواه مسلم.",
    "3. عن أبي عبد الرحمن عبد الله بن عمر بن الخطاب رضي الله عنهما قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"بني الإسلام على خمس: شهادة أن لا إله إلا الله...\" \nمتفق عليه.",
    "4. عن عبد الله بن مسعود رضي الله عنه قال: حدثنا رسول الله صلى الله عليه وسلم وهو الصادق المصدوق... \nرواه البخاري ومسلم.",
    "5. عن أم المؤمنين أم عبد الله عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: \"من أحدث في أمرنا هذا ما ليس منه فهو رد\". \nرواه البخاري ومسلم.",
  ];

  static List<HadithDataModel> hadithData = List.generate(
    hadithTitle.length,
    (index) => HadithDataModel(
      hadithID: (index + 1).toString(),
      hadithName: hadithTitle[index],
      hadithContent: hadithContent[index],
    ),
  );
}
